MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33FJ64MC508A/mcu.h
#define _OC6CON_OCFLT_POSITION                   0x00000004
#define _OC6CON_OCFLT_MASK                       0x00000010
#define _OC6CON_OCFLT_LENGTH                     0x00000001

#define _OC6CON_OCSIDL_POSITION                  0x0000000D
#define _OC6CON_OCSIDL_MASK                      0x00002000
#define _OC6CON_OCSIDL_LENGTH                    0x00000001

#define _OC6CON_OCM0_POSITION                    0x00000000
#define _OC6CON_OCM0_MASK                        0x00000001
#define _OC6CON_OCM0_LENGTH                      0x00000001

#define _OC6CON_OCM1_POSITION                    0x00000001
#define _OC6CON_OCM1_MASK                        0x00000002
#define _OC6CON_OCM1_LENGTH                      0x00000001

#define _OC6CON_OCM2_POSITION                    0x00000002
#define _OC6CON_OCM2_MASK                        0x00000004
#define _OC6CON_OCM2_LENGTH                      0x00000001

#define _OC7CON_OCM_POSITION                     0x00000000
#define _OC7CON_OCM_MASK                         0x00000007
#define _OC7CON_OCM_LENGTH                       0x00000003

#define _OC7CON_OCTSEL_POSITION                  0x00000003
#define _OC7CON_OCTSEL_MASK                      0x00000008
#define _OC7CON_OCTSEL_LENGTH                    0x00000001

#define _OC7CON_OCFLT_POSITION                   0x00000004
#define _OC7CON_OCFLT_MASK                       0x00000010
#define _OC7CON_OCFLT_LENGTH                     0x00000001

#define _OC7CON_OCSIDL_POSITION                  0x0000000D
#define _OC7CON_OCSIDL_MASK                      0x00002000
#define _OC7CON_OCSIDL_LENGTH                    0x00000001

#define _OC7CON_OCM0_POSITION                    0x00000000
#define _OC7CON_OCM0_MASK                        0x00000001
#define _OC7CON_OCM0_LENGTH                      0x00000001

#define _OC7CON_OCM1_POSITION                    0x00000001
#define _OC7CON_OCM1_MASK                        0x00000002
#define _OC7CON_OCM1_LENGTH                      0x00000001

#define _OC7CON_OCM2_POSITION                    0x00000002
#define _OC7CON_OCM2_MASK                        0x00000004
#define _OC7CON_OCM2_LENGTH                      0x00000001

#define _OC8CON_OCM_POSITION                     0x00000000
#define _OC8CON_OCM_MASK                         0x00000007
#define _OC8CON_OCM_LENGTH                       0x00000003

#define _OC8CON_OCTSEL_POSITION                  0x00000003
#define _OC8CON_OCTSEL_MASK                      0x00000008
#define _OC8CON_OCTSEL_LENGTH                    0x00000001

#define _OC8CON_OCFLT_POSITION                   0x00000004
#define _OC8CON_OCFLT_MASK                       0x00000010
#define _OC8CON_OCFLT_LENGTH                     0x00000001

#define _OC8CON_OCSIDL_POSITION                  0x0000000D
#define _OC8CON_OCSIDL_MASK                      0x00002000
#define _OC8CON_OCSIDL_LENGTH                    0x00000001

#define _OC8CON_OCM0_POSITION                    0x00000000
#define _OC8CON_OCM0_MASK                        0x00000001
#define _OC8CON_OCM0_LENGTH                      0x00000001

#define _OC8CON_OCM1_POSITION                    0x00000001
#define _OC8CON_OCM1_MASK                        0x00000002
#define _OC8CON_OCM1_LENGTH                      0x00000001

#define _OC8CON_OCM2_POSITION                    0x00000002
#define _OC8CON_OCM2_MASK                        0x00000004
#define _OC8CON_OCM2_LENGTH                      0x00000001

#define _P1TCON_PTMOD_POSITION                   0x00000000
#define _P1TCON_PTMOD_MASK                       0x00000003
#define _P1TCON_PTMOD_LENGTH                     0x00000002

#define _P1TCON_PTCKPS_POSITION                  0x00000002
#define _P1TCON_PTCKPS_MASK                      0x0000000C
#define _P1TCON_PTCKPS_LENGTH                    0x00000002

#define _P1TCON_PTOPS_POSITION                   0x00000004
#define _P1TCON_PTOPS_MASK                       0x000000F0
#define _P1TCON_PTOPS_LENGTH                     0x00000004

#define _P1TCON_PTSIDL_POSITION                  0x0000000D
#define _P1TCON_PTSIDL_MASK                      0x00002000
#define _P1TCON_PTSIDL_LENGTH                    0x00000001

#define _P1TCON_PTEN_POSITION                    0x0000000F
#define _P1TCON_PTEN_MASK                        0x00008000
#define _P1TCON_PTEN_LENGTH                      0x00000001

#define _P1TCON_PTMOD0_POSITION                  0x00000000
#define _P1TCON_PTMOD0_MASK                      0x00000001
#define _P1TCON_PTMOD0_LENGTH                    0x00000001

#define _P1TCON_PTMOD1_POSITION                  0x00000001
#define _P1TCON_PTMOD1_MASK                      0x00000002
#define _P1TCON_PTMOD1_LENGTH                    0x00000001

#define _P1TCON_PTCKPS0_POSITION                 0x00000002
#define _P1TCON_PTCKPS0_MASK                     0x00000004
#define _P1TCON_PTCKPS0_LENGTH                   0x00000001

#define _P1TCON_PTCKPS1_POSITION                 0x00000003
#define _P1TCON_PTCKPS1_MASK                     0x00000008
#define _P1TCON_PTCKPS1_LENGTH                   0x00000001

#define _P1TCON_PTOPS0_POSITION                  0x00000004
#define _P1TCON_PTOPS0_MASK                      0x00000010
#define _P1TCON_PTOPS0_LENGTH                    0x00000001

#define _P1TCON_PTOPS1_POSITION                  0x00000005
#define _P1TCON_PTOPS1_MASK                      0x00000020
#define _P1TCON_PTOPS1_LENGTH                    0x00000001

#define _P1TCON_PTOPS2_POSITION                  0x00000006
#define _P1TCON_PTOPS2_MASK                      0x00000040
#define _P1TCON_PTOPS2_LENGTH                    0x00000001

#define _P1TCON_PTOPS3_POSITION                  0x00000007
#define _P1TCON_PTOPS3_MASK                      0x00000080
#define _P1TCON_PTOPS3_LENGTH                    0x00000001

#define _PTCON_PTMOD_POSITION                    0x00000000
#define _PTCON_PTMOD_MASK                        0x00000003
#define _PTCON_PTMOD_LENGTH                      0x00000002

#define _PTCON_PTCKPS_POSITION                   0x00000002
#define _PTCON_PTCKPS_MASK                       0x0000000C
#define _PTCON_PTCKPS_LENGTH                     0x00000002

#define _PTCON_PTOPS_POSITION                    0x00000004
#define _PTCON_PTOPS_MASK                        0x000000F0
#define _PTCON_PTOPS_LENGTH                      0x00000004

#define _PTCON_PTSIDL_POSITION                   0x0000000D
#define _PTCON_PTSIDL_MASK                       0x00002000
#define _PTCON_PTSIDL_LENGTH                     0x00000001

#define _PTCON_PTEN_POSITION                     0x0000000F
#define _PTCON_PTEN_MASK                         0x00008000
#define _PTCON_PTEN_LENGTH                       0x00000001

#define _PTCON_PTMOD0_POSITION                   0x00000000
#define _PTCON_PTMOD0_MASK                       0x00000001
#define _PTCON_PTMOD0_LENGTH                     0x00000001

#define _PTCON_PTMOD1_POSITION                   0x00000001
#define _PTCON_PTMOD1_MASK                       0x00000002
#define _PTCON_PTMOD1_LENGTH                     0x00000001

#define _PTCON_PTCKPS0_POSITION                  0x00000002
#define _PTCON_PTCKPS0_MASK                      0x00000004
#define _PTCON_PTCKPS0_LENGTH                    0x00000001

#define _PTCON_PTCKPS1_POSITION                  0x00000003
#define _PTCON_PTCKPS1_MASK                      0x00000008
#define _PTCON_PTCKPS1_LENGTH                    0x00000001

